; domain
(define (domain depot)
(:requirements :strips :typing)
(:types
    place locatable - object
    depot distributor - place
    truck hoist surface - locatable
    pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action drive
  :parameters (?x - truck ?y - place ?z - place) 
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob4443) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 distributor0)
	(clear crate13)
	(at pallet2 distributor1)
	(clear crate8)
	(at pallet3 depot0)
	(clear crate11)
	(at pallet4 distributor1)
	(clear crate12)
	(at pallet5 distributor0)
	(clear crate9)
	(at truck0 depot0)
	(at truck1 depot0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 distributor1)
	(on crate1 pallet2)
	(at crate2 distributor0)
	(on crate2 pallet1)
	(at crate3 depot0)
	(on crate3 pallet3)
	(at crate4 depot0)
	(on crate4 crate3)
	(at crate5 distributor1)
	(on crate5 crate1)
	(at crate6 distributor0)
	(on crate6 crate2)
	(at crate7 distributor1)
	(on crate7 pallet4)
	(at crate8 distributor1)
	(on crate8 crate5)
	(at crate9 distributor0)
	(on crate9 pallet5)
	(at crate10 depot0)
	(on crate10 crate4)
	(at crate11 depot0)
	(on crate11 crate10)
	(at crate12 distributor1)
	(on crate12 crate7)
	(at crate13 distributor0)
	(on crate13 crate6)
)

(:goal (and
		(on crate1 pallet3)
		(on crate2 crate11)
		(on crate3 pallet4)
		(on crate4 pallet2)
		(on crate5 crate8)
		(on crate6 crate4)
		(on crate8 pallet0)
		(on crate9 crate1)
		(on crate10 pallet5)
		(on crate11 crate12)
		(on crate12 pallet1)
		(on crate13 crate9)
	)
))

; plan
1. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 0 of 12
2. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 0 of 12
3. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 0 of 12
4. (lift hoist2 crate12 crate7 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist2) (on crate12 crate7)
   added: (lifting hoist2 crate12) (clear crate7)
   goals met: 0 of 12
5. (load hoist2 crate12 truck0 distributor1)
   deleted: (lifting hoist2 crate12)
   added: (in crate12 truck0) (available hoist2)
   goals met: 0 of 12
6. (lift hoist2 crate7 pallet4 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist2) (on crate7 pallet4)
   added: (lifting hoist2 crate7) (clear pallet4)
   goals met: 0 of 12
7. (lift hoist1 crate13 crate6 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist1) (on crate13 crate6)
   added: (lifting hoist1 crate13) (clear crate6)
   goals met: 0 of 12
8. (drop hoist1 crate13 crate9 distributor0)
   deleted: (lifting hoist1 crate13) (clear crate9)
   added: (available hoist1) (at crate13 distributor0) (clear crate13) (on crate13 crate9)
   goals met: 1 of 12
9. (lift hoist1 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist1) (on crate6 crate2)
   added: (lifting hoist1 crate6) (clear crate2)
   goals met: 1 of 12
10. (load hoist1 crate6 truck1 distributor0)
   deleted: (lifting hoist1 crate6)
   added: (in crate6 truck1) (available hoist1)
   goals met: 1 of 12
11. (lift hoist1 crate2 pallet1 distributor0)
   deleted: (at crate2 distributor0) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 1 of 12
12. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 1 of 12
13. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   goals met: 1 of 12
14. (load hoist1 crate2 truck0 distributor0)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 1 of 12
15. (unload hoist1 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist1)
   added: (lifting hoist1 crate12)
   goals met: 1 of 12
16. (drop hoist1 crate12 pallet1 distributor0)
   deleted: (lifting hoist1 crate12) (clear pallet1)
   added: (available hoist1) (at crate12 distributor0) (clear crate12) (on crate12 pallet1)
   goals met: 2 of 12
17. (load hoist2 crate7 truck1 distributor1)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck1) (available hoist2)
   goals met: 2 of 12
18. (lift hoist2 crate8 crate5 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate5)
   added: (lifting hoist2 crate8) (clear crate5)
   goals met: 2 of 12
19. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   goals met: 2 of 12
20. (lift hoist2 crate5 crate1 distributor1)
   deleted: (at crate5 distributor1) (clear crate5) (available hoist2) (on crate5 crate1)
   added: (lifting hoist2 crate5) (clear crate1)
   goals met: 2 of 12
21. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 2 of 12
22. (drop hoist0 crate0 crate11 depot0)
   deleted: (lifting hoist0 crate0) (clear crate11)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate11)
   goals met: 2 of 12
23. (unload hoist0 crate8 truck1 depot0)
   deleted: (in crate8 truck1) (available hoist0)
   added: (lifting hoist0 crate8)
   goals met: 2 of 12
24. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 2 of 12
25. (load hoist2 crate5 truck1 distributor1)
   deleted: (lifting hoist2 crate5)
   added: (in crate5 truck1) (available hoist2)
   goals met: 2 of 12
26. (drop hoist0 crate8 pallet0 depot0)
   deleted: (lifting hoist0 crate8) (clear pallet0)
   added: (available hoist0) (at crate8 depot0) (clear crate8) (on crate8 pallet0)
   goals met: 3 of 12
27. (lift hoist0 crate0 crate11 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 crate11)
   added: (lifting hoist0 crate0) (clear crate11)
   goals met: 3 of 12
28. (lift hoist2 crate1 pallet2 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 3 of 12
29. (load hoist2 crate1 truck1 distributor1)
   deleted: (lifting hoist2 crate1)
   added: (in crate1 truck1) (available hoist2)
   goals met: 3 of 12
30. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 3 of 12
31. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 3 of 12
32. (unload hoist1 crate1 truck1 distributor0)
   deleted: (in crate1 truck1) (available hoist1)
   added: (lifting hoist1 crate1)
   goals met: 3 of 12
33. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   goals met: 3 of 12
34. (drop hoist1 crate1 crate13 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate13)
   added: (available hoist1) (at crate1 distributor0) (clear crate1) (on crate1 crate13)
   goals met: 3 of 12
35. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 3 of 12
36. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 3 of 12
37. (drop hoist0 crate0 crate11 depot0)
   deleted: (lifting hoist0 crate0) (clear crate11)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate11)
   goals met: 3 of 12
38. (unload hoist0 crate5 truck1 depot0)
   deleted: (in crate5 truck1) (available hoist0)
   added: (lifting hoist0 crate5)
   goals met: 3 of 12
39. (drop hoist0 crate5 crate8 depot0)
   deleted: (lifting hoist0 crate5) (clear crate8)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate8)
   goals met: 4 of 12
40. (unload hoist0 crate6 truck1 depot0)
   deleted: (in crate6 truck1) (available hoist0)
   added: (lifting hoist0 crate6)
   goals met: 4 of 12
41. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 4 of 12
42. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 12
43. (lift hoist1 crate1 crate13 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist1) (on crate1 crate13)
   added: (lifting hoist1 crate1) (clear crate13)
   goals met: 4 of 12
44. (load hoist1 crate1 truck0 distributor0)
   deleted: (lifting hoist1 crate1)
   added: (in crate1 truck0) (available hoist1)
   goals met: 4 of 12
45. (drop hoist0 crate6 crate5 depot0)
   deleted: (lifting hoist0 crate6) (clear crate5)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate5)
   goals met: 4 of 12
46. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 4 of 12
47. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   goals met: 4 of 12
48. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 12
49. (drop hoist0 crate1 crate6 depot0)
   deleted: (lifting hoist0 crate1) (clear crate6)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate6)
   goals met: 4 of 12
50. (lift hoist0 crate0 crate11 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 crate11)
   added: (lifting hoist0 crate0) (clear crate11)
   goals met: 4 of 12
51. (drop hoist0 crate0 crate1 depot0)
   deleted: (lifting hoist0 crate0) (clear crate1)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate1)
   goals met: 4 of 12
52. (lift hoist0 crate11 crate10 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate10)
   added: (lifting hoist0 crate11) (clear crate10)
   goals met: 4 of 12
53. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 4 of 12
54. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   goals met: 4 of 12
55. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 4 of 12
56. (unload hoist1 crate11 truck0 distributor0)
   deleted: (in crate11 truck0) (available hoist1)
   added: (lifting hoist1 crate11)
   goals met: 4 of 12
57. (drop hoist1 crate11 crate12 distributor0)
   deleted: (lifting hoist1 crate11) (clear crate12)
   added: (available hoist1) (at crate11 distributor0) (clear crate11) (on crate11 crate12)
   goals met: 5 of 12
58. (lift hoist0 crate10 crate4 depot0)
   deleted: (at crate10 depot0) (clear crate10) (available hoist0) (on crate10 crate4)
   added: (lifting hoist0 crate10) (clear crate4)
   goals met: 5 of 12
59. (unload hoist1 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist1)
   added: (lifting hoist1 crate2)
   goals met: 5 of 12
60. (drop hoist1 crate2 crate11 distributor0)
   deleted: (lifting hoist1 crate2) (clear crate11)
   added: (available hoist1) (at crate2 distributor0) (clear crate2) (on crate2 crate11)
   goals met: 6 of 12
61. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 6 of 12
62. (load hoist0 crate10 truck0 depot0)
   deleted: (lifting hoist0 crate10)
   added: (in crate10 truck0) (available hoist0)
   goals met: 6 of 12
63. (lift hoist0 crate4 crate3 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist0) (on crate4 crate3)
   added: (lifting hoist0 crate4) (clear crate3)
   goals met: 6 of 12
64. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 6 of 12
65. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 6 of 12
66. (lift hoist0 crate3 pallet3 depot0)
   deleted: (at crate3 depot0) (clear crate3) (available hoist0) (on crate3 pallet3)
   added: (lifting hoist0 crate3) (clear pallet3)
   goals met: 6 of 12
67. (unload hoist1 crate10 truck0 distributor0)
   deleted: (in crate10 truck0) (available hoist1)
   added: (lifting hoist1 crate10)
   goals met: 6 of 12
68. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 6 of 12
69. (load hoist0 crate3 truck0 depot0)
   deleted: (lifting hoist0 crate3)
   added: (in crate3 truck0) (available hoist0)
   goals met: 6 of 12
70. (lift hoist0 crate0 crate1 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 crate1)
   added: (lifting hoist0 crate0) (clear crate1)
   goals met: 6 of 12
71. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 6 of 12
72. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 6 of 12
73. (unload hoist2 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist2)
   added: (lifting hoist2 crate3)
   goals met: 6 of 12
74. (drop hoist2 crate3 pallet4 distributor1)
   deleted: (lifting hoist2 crate3) (clear pallet4)
   added: (available hoist2) (at crate3 distributor1) (clear crate3) (on crate3 pallet4)
   goals met: 7 of 12
75. (unload hoist2 crate4 truck0 distributor1)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   goals met: 7 of 12
76. (drop hoist2 crate4 pallet2 distributor1)
   deleted: (lifting hoist2 crate4) (clear pallet2)
   added: (available hoist2) (at crate4 distributor1) (clear crate4) (on crate4 pallet2)
   goals met: 8 of 12
77. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 8 of 12
78. (lift hoist0 crate1 crate6 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 crate6)
   added: (lifting hoist0 crate1) (clear crate6)
   goals met: 8 of 12
79. (drop hoist0 crate1 pallet3 depot0)
   deleted: (lifting hoist0 crate1) (clear pallet3)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 pallet3)
   goals met: 9 of 12
80. (lift hoist0 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate5)
   added: (lifting hoist0 crate6) (clear crate5)
   goals met: 9 of 12
81. (load hoist0 crate6 truck1 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck1) (available hoist0)
   goals met: 9 of 12
82. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 9 of 12
83. (unload hoist2 crate6 truck1 distributor1)
   deleted: (in crate6 truck1) (available hoist2)
   added: (lifting hoist2 crate6)
   goals met: 9 of 12
84. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   goals met: 9 of 12
85. (drop hoist2 crate6 crate4 distributor1)
   deleted: (lifting hoist2 crate6) (clear crate4)
   added: (available hoist2) (at crate6 distributor1) (clear crate6) (on crate6 crate4)
   goals met: 10 of 12
86. (drop hoist1 crate10 crate2 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate2)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate2)
   goals met: 10 of 12
87. (lift hoist1 crate13 crate9 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist1) (on crate13 crate9)
   added: (lifting hoist1 crate13) (clear crate9)
   goals met: 9 of 12
88. (drop hoist1 crate13 crate10 distributor0)
   deleted: (lifting hoist1 crate13) (clear crate10)
   added: (available hoist1) (at crate13 distributor0) (clear crate13) (on crate13 crate10)
   goals met: 9 of 12
89. (lift hoist1 crate9 pallet5 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 pallet5)
   added: (lifting hoist1 crate9) (clear pallet5)
   goals met: 9 of 12
90. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 9 of 12
91. (load hoist1 crate9 truck1 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck1) (available hoist1)
   goals met: 9 of 12
92. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 9 of 12
93. (unload hoist0 crate9 truck1 depot0)
   deleted: (in crate9 truck1) (available hoist0)
   added: (lifting hoist0 crate9)
   goals met: 9 of 12
94. (drop hoist0 crate9 crate1 depot0)
   deleted: (lifting hoist0 crate9) (clear crate1)
   added: (available hoist0) (at crate9 depot0) (clear crate9) (on crate9 crate1)
   goals met: 10 of 12
95. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   goals met: 10 of 12
96. (lift hoist1 crate13 crate10 distributor0)
   deleted: (at crate13 distributor0) (clear crate13) (available hoist1) (on crate13 crate10)
   added: (lifting hoist1 crate13) (clear crate10)
   goals met: 10 of 12
97. (load hoist1 crate13 truck1 distributor0)
   deleted: (lifting hoist1 crate13)
   added: (in crate13 truck1) (available hoist1)
   goals met: 10 of 12
98. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   goals met: 10 of 12
99. (unload hoist0 crate13 truck1 depot0)
   deleted: (in crate13 truck1) (available hoist0)
   added: (lifting hoist0 crate13)
   goals met: 10 of 12
100. (lift hoist1 crate10 crate2 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate2)
   added: (lifting hoist1 crate10) (clear crate2)
   goals met: 10 of 12
101. (drop hoist1 crate10 pallet5 distributor0)
   deleted: (lifting hoist1 crate10) (clear pallet5)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 pallet5)
   goals met: 11 of 12
102. (drop hoist0 crate13 crate9 depot0)
   deleted: (lifting hoist0 crate13) (clear crate9)
   added: (available hoist0) (at crate13 depot0) (clear crate13) (on crate13 crate9)
   goals met: 12 of 12
